#Напишите программу, которая будет преобразовывать 
# десятичное число в двоичное.

#*Пример:*

#- 45 -> 101101
#- 3 -> 11
#- 2 -> 10
N= int(input('введите число  => '))
print (bin(N))